buoyantPimpleFoam_timevaryingBC/chockedNozzle/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version         2;
    format          ascii;
    class           volVectorField;
    location        "0";
    object          U;
}

dimensions      [ 0 1 -1 0 0 0 0 ];

internalField   uniform ( 0 0 0 );

boundaryField
{
    inletair
    {
        type            flowRateInletVelocity;
        value           uniform ( 0 0 0 );
        massFlowRate    csvFile;
        nHeaderLine     1;
        refColumn       0;
        componentColumns ( 1 );
        separator       ",";
        mergeSeparators no;
        file             "<constant>/inlet.csv";


    }
    outlet
    {
        type            pressureInletOutletVelocity;
        value           uniform (0.0 0 0);
        inletValue      uniform (0 0 0);
    }
    walls
    {
        type            fixedValue;
        value           uniform ( 0 0 0 );
    }
}


// ************************************************************************* //
